ETL/DataProcessors/КонструкторСоответствияПолей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>КонструкторСоответствияПолей</Name>
			<Comment>Конструктор соответствия полей. Версия 1.11</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>База</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Базы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

ETL/Catalogs/ЕдиныйФорматДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ЕдиныйФорматДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидТаблицы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТаблицSQL</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВременнаяТаблица</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВременнаяТаблица</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьТаблицаИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяТаблица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиныйФорматДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пояснение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьРегистратор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗаполнятьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктураТаблицыSQL</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоляSQL</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПоля</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыПолейSQL</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Индекс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Измерение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИтогиИзмерение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИтогиРесурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контроль</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтруктураТаблицыSQLДляКопирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоляSQL</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПоля</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыПолейSQL</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/DataProcessors/КонструкторСоответствияПолей/Forms/ФормаВыбораПолейТаблицыЕФД/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Реквизит Из ПолучитьРеквизиты() Цикл
		ИмяРеквизита = Реквизит.Имя;
		
		Если Параметры.Свойство(ИмяРеквизита) Тогда 
			ЭтаФорма[ИмяРеквизита] = Параметры[ИмяРеквизита];
		КонецЕсли;
		
	КонецЦикла;
		
	ОбновитьСоставПолей();
		
КонецПроцедуры  

&НаСервере
Процедура ОбновитьСоставПолей()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Т.КлючСвязи КАК КлючСвязи,
	                      |	Т.ИмяПоля КАК ИмяПоля,
	                      |	Т.ИмяПоляSQL КАК ИмяПоляSQL,
	                      |	Т.Синоним КАК Синоним
	                      |ИЗ
	                      |	Справочник.ЕдиныйФорматДанных.СтруктураТаблицыSQL КАК Т
	                      |ГДЕ
	                      |	Т.Ссылка = &Ссылка
	                      |	И НЕ Т.КлючСвязи = 0");   
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектЕдиногоФорматаДанных);    
	
	тзСтруктураТаблицыSQL.Загрузить(Запрос.Выполнить().Выгрузить());
		
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЭлемент()
	
	ТекДанные = Элементы.тзСтруктураТаблицыSQL.ТекущиеДанные;
	Закрыть(Новый Структура("ОбъектЕдиногоФорматаДанных, КлючСвязи", 
							ОбъектЕдиногоФорматаДанных,
							ТекДанные.КлючСвязи));

КонецПроцедуры

&НаКлиенте
Процедура СтруктураТаблицыSQLВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбратьЭлемент()
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьФокусИнтерактивногоПодбора()
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФокусИнтерактивногоПодбора() 
	
	ИмяОбъектаИтерации = "тзСтруктураТаблицыSQL";
	
	СписокПолейПоиска = Новый СписокЗначений;
	СписокПолейПоиска.Добавить("КлючСвязи");
	СписокПолейПоиска.Добавить("Синоним");
	
	КоллекцияЭлементовДерева = Элементы[ИмяОбъектаИтерации]; 
	
	Для Каждого ЗначениеСписка Из СписокПолейПоиска Цикл 
		
		ИмяПоля = ЗначениеСписка.Значение;
		
		НайденныйЭлементДерева = НайтиЭлементВКоллекции(ЭтаФорма[ИмяОбъектаИтерации], Новый Структура(ИмяПоля, ЭтаФорма[ИмяПоля]));  
		Если НЕ НайденныйЭлементДерева = Неопределено Тогда
			КоллекцияЭлементовДерева.ТекущаяСтрока = НайденныйЭлементДерева.ПолучитьИдентификатор(); 
			Прервать;
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиЭлементВКоллекции(КоллекцияЭлементовДерева, СтруктураПоиска) 
	
	ЭлементКоллекции = Неопределено;
	
	Для Каждого СтрокаКоллекции Из КоллекцияЭлементовДерева Цикл  
		
		ЭлементСоответствуетПараметрамПоиска = Истина;    
		
		Для Каждого КлючИЗначение Из СтруктураПоиска Цикл
			
			Если НЕ СтрокаКоллекции[КлючИЗначение.Ключ] = КлючИЗначение.Значение Тогда
				ЭлементСоответствуетПараметрамПоиска = Ложь;
				Прервать;
			КонецЕсли;
						
		КонецЦикла;
			
		Если ЭлементСоответствуетПараметрамПоиска Тогда
			ЭлементКоллекции = СтрокаКоллекции  
		КонецЕсли;
		
		Если НЕ ЭлементКоллекции = Неопределено Тогда 
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЭлементКоллекции
	
КонецФункции
